Masmiseim36/nxpSDK/boards/mimxrt700evk/driver_examples/sdadc/sdadc_sai_interrupt/cm33_core0/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v16.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOA
mcu_data: ksdk2_0
processor_version: 0.2412.10
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N4, peripheral: LP_FLEXCOMM0, signal: P0, pin_signal: PIO0_31/LP_FLEXCOMM0_P0/UTICK0_CAP2/SCT0_OUT8/CTIMER4_MAT0, input_buffer: enable}
  - {pin_num: N5, peripheral: LP_FLEXCOMM0, signal: P1, pin_signal: PIO1_0/LP_FLEXCOMM0_P1/SCT0_OUT9/CTIMER4_MAT1, input_buffer: disable}
  - {pin_num: J1, peripheral: SAI0, signal: RX_BCLK, pin_signal: PIO0_0/LP_FLEXCOMM8_P2/SCT0_GPIN0/SCT0_OUT0/CTIMER_C_INP9/SAI0_RX_BCLK/SAI1_TX_BCLK, input_buffer: enable}
  - {pin_num: J2, peripheral: SAI0, signal: RX_SYNC, pin_signal: PIO0_1/LP_FLEXCOMM8_P3/SCT0_GPIN1/SCT0_OUT1/CTIMER0_MAT0/SAI0_RX_SYNC/SAI1_RX_DATA, input_buffer: enable}
  - {pin_num: J3, peripheral: SAI0, signal: RXD0, pin_signal: PIO0_2/LP_FLEXCOMM8_P4/SCT0_GPIN2/SCT0_OUT2/CTIMER0_MAT1/SAI0_RX_DATA/LP_FLEXCOMM9_P0, input_buffer: enable}
  - {pin_num: J4, peripheral: SAI0, signal: TX_BCLK, pin_signal: PIO0_3/LP_FLEXCOMM4_P0/SCT0_GPIN3/SCT0_OUT3/CTIMER0_MAT2/SAI0_TX_BCLK, input_buffer: enable}
  - {pin_num: K4, peripheral: SAI0, signal: TXD0, pin_signal: PIO0_4/LP_FLEXCOMM4_P1/SCT0_GPIN4/SCT0_OUT4/CTIMER0_MAT3/SAI0_TX_DATA, input_buffer: enable}
  - {pin_num: K3, peripheral: SAI0, signal: TX_SYNC, pin_signal: PIO0_5/LP_FLEXCOMM4_P4/SCT0_GPIN5/SCT0_OUT5/CTIMER2_MAT0/SAI0_TX_SYNC/CLKCTL0_MCLK/LP_FLEXCOMM9_P1,
    input_buffer: enable}
  - {pin_num: M2, peripheral: CLKCTL0, signal: MCLK, pin_signal: PIO0_21/LP_FLEXCOMM6_P0/SCT0_GPIN6/SCT0_OUT6/CTIMER_C_INP4/SAI1_TX_DATA/CLKCTL0_MCLK, selects_transmitter_current_drive: O_33,
    input_buffer: enable}
  - {pin_num: R2, peripheral: LP_FLEXCOMM2, signal: P0, pin_signal: PIO1_11/LP_FLEXCOMM2_P0/CTIMER2_MAT2/SWD_TRACEDATA0, open_drain: enable, input_buffer: enable}
  - {pin_num: R1, peripheral: LP_FLEXCOMM2, signal: P1, pin_signal: PIO1_12/LP_FLEXCOMM2_P1/SCT0_GPIN3/SCT0_OUT9/CTIMER1_MAT1/SWD_TRACEDATA1, open_drain: enable,
    input_buffer: enable}
  - {pin_num: T14, peripheral: SDADC, signal: 'INP, 0', pin_signal: PIO10_6}
  - {pin_num: U15, peripheral: SDADC, signal: 'INP, 1', pin_signal: PIO10_12/PDM_DATA67/ADC0_A4/SDADC_INP1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t port0_pin0_config = (/* Pin is configured as SAI0_RX_BCLK */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN0 (coords: J1) is configured as SAI0_RX_BCLK */
    IOPCTL_PinMuxSet(0U, 0U, port0_pin0_config);

    const uint32_t port0_pin1_config = (/* Pin is configured as SAI0_RX_SYNC */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN1 (coords: J2) is configured as SAI0_RX_SYNC */
    IOPCTL_PinMuxSet(0U, 1U, port0_pin1_config);

